# Задача 2. Долги

name = input('Введите имя: ')
debt = input('Введите долг: ')
print('{0}! {0}, привет! Как дела, {0}? Где мои {1} рублей? {0}! '.format(name, debt))